He-YanHao/MCU_Project/32/STM32F40x_Project_标准库/DAC音乐播放器/system/MyDAC.c
#include "stm32f4xx.h"                  // Device header

void MyDAC_Init(void)
{
    //DAC通道1输出初始化 PA4
    //结构体初始化
    GPIO_InitTypeDef  GPIO_InitStructure;
    DAC_InitTypeDef DAC_InitType;
    //开启时钟
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA,ENABLE);//使能GPIOA时钟
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC,ENABLE);//使能DAC时钟
    //GPIOA初始化
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
    GPIO_InitStructure.GPIO_Mode =GPIO_Mode_AN;//模拟输入
    GPIO_InitStructure.GPIO_PuPd =GPIO_PuPd_DOWN;//下拉
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;//最快速
    GPIO_Init(GPIOA, &GPIO_InitStructure);//初始化
    //DAC初始化
    DAC_InitType.DAC_Trigger=DAC_Trigger_None;//不使用触发功能 TEN1=0 // 触发方式，这里设置为无触发  
    DAC_InitType.DAC_WaveGeneration=DAC_WaveGeneration_None;// 波形生成，这里设置为不生成波形  
    DAC_InitType.DAC_LFSRUnmask_TriangleAmplitude=DAC_LFSRUnmask_Bit0;//屏蔽、幅值设置
    DAC_InitType.DAC_OutputBuffer=DAC_OutputBuffer_Disable;//DAC1输出缓存关闭BOFF1=1
    DAC_Init(DAC_Channel_1,&DAC_InitType); 
    //初始化DAC通道1
    DAC_Cmd(DAC_Channel_1, ENABLE);  //使能DAC通道1
    DAC_SetChannel1Data(DAC_Align_12b_R, 0);  //12位右对齐数据格式设置DAC值
}

//设置通道1输出电压
//vol:0~3300,代表0~3.3V
void Dac1_Set_Vol(u16 vol)
{
    double temp=vol;
    temp/=1000;
    temp=temp*4096/3.3;
    DAC_SetChannel1Data(DAC_Align_12b_R,temp);//12位右对齐数据格式设置DAC值
}
